#Область ОбработчикиСобытий

// Проверка совпадения артикула и кода номенклатуры.
// Требование ТЗ п. 4.1, тест-кейс ПиМИ № 12.
&После("ПередЗаписью")
Процедура КС_ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(Артикул) И Артикул <> Код Тогда
		ОбщегоНазначения.СообщитьПользователю("Артикул ""должен"" совпадать с кодом", , , , Отказ); // комментарий Вызов()
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КС_ГлубинаВыгрузки(Месяцев = 36) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура
	|ГДЕ ДатаСоздания >= &Дата";
	Возврат КС_Гамма.Отбор(Запрос.Выполнить());
КонецФункции

#КонецОбласти
